Revit 2024 API
RelinquishedItems.GetRelinquishedWorksets Method
 The elements that were relinquished by the current user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ICollection<WorksetId> GetRelinquishedWorksets()
Visual Basic
Public Function GetRelinquishedWorksets As ICollection(Of WorksetId)
Visual C++
public:
ICollection<WorksetId^>^ GetRelinquishedWorksets()
See Also
RelinquishedItems Class
Autodesk.Revit.DB Namespace